docs: rewrite project README
